testing/artilleryScript.yaml
config:
  target: "https://shopping.service.staging"
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up
    - duration: 120
      arrivalRate: 5
      rampTo: 50
      name: Ramp up load
    - duration: 600
      arrivalRate: 50
      name: Sustained load
scenarios:
  # We define one scenario:
  - name: "Search and buy"
    flow:
      # Get the details of the product:
      - get:
          url: "/product/{{ id }}"
      # Pause for 3 seconds:
      - think: 3